app/Controllers/API/CarsController.php

    public function index()
    {
        $pageNo = $this->request->getVar('page') !== null ? $this->request->getVar('page')-1 : 0;
        $items = $this->cache->get($this->cacheKey."-".$pageNo);

        if($items == null)
        {
            $limit = 10;
            $offset = $pageNo*$limit;
            $carsModel = new Cars();
            try{
                $cars = $carsModel->select('cars.id, cars.model, cars.year, cars.vin, cars.shipping_status, cm.title as make, cars.created_at, cars.updated_at')
                                ->join('cars_make as cm', 'cm.id = cars.make_id')
                                ->where('cars.status', 1)->orderBy('cars.created_at', 'DESC')->limit($limit, $offset)->findAll();
---
SELECT `cars`.`id`, `cars`.`model`, `cars`.`year`, `cars`.`vin`, `cars`.`shipping_status`, `cm`.`title` as `make`, `cars`.`created_at`, `cars`.`updated_at`
FROM `cars`
JOIN `cars_make` as `cm` ON `cm`.`id` = `cars`.`make_id`
WHERE `cars`.`status` = 1
ORDER BY `cars`.`created_at` DESC