app/Controllers/API/CarsMakeController.php

SELECT *
FROM `cars_make`
WHERE `status` = 1
ORDER BY `title` ASC
---
    public function index()
    {
        $carsModel = new CarsMake();
        try{
            $cars = $carsModel->where('status', 1)->orderBy('title', 'ASC')->findAll();