app/Controllers/API/UsersController.php

    public function login()
    {
        $request = $this->request->getJSON(true);
        $rules = [
            'email' => 'required|valid_email',
            'password' => 'required'
        ];
        if(! $this->validate($rules) )
        {
            return $this->userResponse->respond(['error' => $this->validtor->getErrors()], 400);
        }

        $userModel = new User();
        $user = $userModel->where('email' , $request['email'])
                        ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'testing@test.com'
 LIMIT 1